

#include <iostream>
/*Користувач вводить три цілі числа `m`, `n` і `k`, де `m` — кількість рядків, `n` — кількість стовпців, а `k` — товщина заповненої межі. Програма має вивести на екран порожнистий прямокутник розміром `m` на `n`, у якому межа товщиною `k` заповнена символами `*`, а внутрішня область залишається порожньою.

**Вхідні дані**: Три цілі числа `m`, `n` і `k` (1 ≤ `k` < `m`, `k` < `n`, 1 ≤ `m`, `n` ≤ 100).*/
int main() {
    int m, n, k;
    
    std::cout << "Кількість рядків: ";
    std::cin >> m;
    std::cout << "Кількість стовпців: ";
    std::cin >> n;
    std::cout << "Товщина межі: ";
    std::cin >> k;

    for (int i = 0; i < m; i++) {
        for (int j = 0; j < n; j++) {
            if (i < k || i >= m - k || j < k || j >= n - k) {
                std::cout << '*';
            } else {
                std::cout << ' ';
            }
        }
        std::cout << std::endl;
    }
}

