#include <iostream>
/*Користувач вводить два цілі числа `m` і `n`, де `m` — кількість рядків, а `n` — кількість стовпців. Програма має заповнити двовимірний масив розміром `m` на `n` числами у вигляді "змійки": перший рядок заповнюється зліва направо, другий — справа наліво, третій — зліва направо і так далі.
*/
int main (){
int m, n;
std::cout << "Кількість рядків: ";
std::cin >> m;
std::cout << "Кількість стовпців: ";
std::cin >> n;
int counter = 0;  
for (int i = 0; i < m; i++) {
if (i % 2 == 0) {
for (int j = 0; j < n; j++) {
std::cout << counter++ << " ";
}
} 
else {
           
int end = counter + n - 1;
for (int j = 0; j < n; j++) {
std::cout << end-- << " ";
counter++;
}
}
std::cout << std::endl;  
}
}
