/*Решетом Ератосфена називається процедура, при якiй спочатку записують
послiдовнi числа від 2 до n. Залишивши число 2, викреслюють кожне
друге. Переходять до наступного не викреслення числа. Це 3. Його
залишають, а викреслюють кожне третє. Дiють так до тих пiр, поки не
доберуться до кінця послiдовностi. Побудуйте решето для першої тисячі
чисел.*/
      

#include <iostream>

int main() {
    int n = 1000;)
    bool sieve[n + 1]; 
    for (int i = 0; i <= n; i++) {
        sieve[i] = true;
    }

    sieve[0] = sieve[1] = false;

    for (int i = 2; i * i <= n; i++) {
        if (sieve[i]) {
            for (int j = i * i; j <= n; j += i) {
                sieve[j] = false;
            }
        }
    }

    for (int i = 2; i <= n; i++) {
        if (sieve[i]) {
            std::cout << i << " ";
        }
    }

    return 0;
}

