#include <iostream>
/*Користувач вводить два цілі числа `m` і `n`, де `m` — кількість рядків, а `n` — кількість стовпців. Програма має заповнити квадрат розміром `m` на `n` числами від `0` до `m * n - 1` послідовно зліва направо та зверху вниз і вивести його на екран.*/
int main (){
int m,n;
std::cout << "Кількість рядків: ";
std::cin >> m;
std::cout << "Кількість стовпців: ";
std::cin >> n;
int counter = 0;
for (int i=0; i<m; i++)
{
	for (int k=0; k<n; k++){
	std::cout << counter << ' ';
	counter++;

}
 std::cout << std::endl;

}

}
